# Learn about pandas.


      Pandas deals with the data analyse, data manipulation,transformation etc.. operation with data. It deals with the structured database.

> Import pandas

> Check version

> Generate dataframe 

> Print dataframe

> Acess dataframe rows and columns

> Access with loc and iloc

In [1]:
import numpy as np
import pandas as pd
print(pd.__version__)

2.2.2

In [2]:
data1={"Name":["rahul","nisha","paras","kaliya"],
      "Branch":["AI&DS","AI&DS","CSE","POGO"],
      "College":["ACE","ACE","JEC","BHEEM"],
      "roll_no":[10,12,56,23]}
data1   # Dictionary is also like a data structure

{'Name': ['rahul', 'nisha', 'paras', 'kaliya'],
 'Branch': ['AI&DS', 'AI&DS', 'CSE', 'POGO'],
 'College': ['ACE', 'ACE', 'JEC', 'BHEEM'],
 'roll_no': [10, 12, 56, 23]}

In [3]:
df1=pd.DataFrame(data1)    # Make dataframe of data
df1

     Name Branch College  roll_no
0   rahul  AI&DS     ACE       10
1   nisha  AI&DS     ACE       12
2   paras    CSE     JEC       56
3  kaliya   POGO   BHEEM       23

In [4]:
data = {"Name":["sachin",'lakshay','saurabh','abhishek'],
       "Branch":["cse",'it','ece','cse'],
       "college":['piet','jecrc','raffels','piet'],
       "roll_no":[10,20,30,50]}
data

{'Name': ['sachin', 'lakshay', 'saurabh', 'abhishek'],
 'Branch': ['cse', 'it', 'ece', 'cse'],
 'college': ['piet', 'jecrc', 'raffels', 'piet'],
 'roll_no': [10, 20, 30, 50]}

In [5]:
df=pd.DataFrame(data)    # Make dataframe of data
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [6]:
type(df)   # the type to confirmation

pandas.core.frame.DataFrame

In [7]:
df['Name'] #access a single column

0      sachin
1     lakshay
2     saurabh
3    abhishek
Name: Name, dtype: object

In [8]:
type(df['Name'])  # column is known as series

pandas.core.series.Series

In [9]:
df.roll_no  # another way to accessa single column

0    10
1    20
2    30
3    50
Name: roll_no, dtype: int64

In [10]:
df[["Name","Branch"]]  # to access multiple columns

       Name Branch
0    sachin    cse
1   lakshay     it
2   saurabh    ece
3  abhishek    cse

In [11]:
df[["college","roll_no","college"]]  # it shows order dosen't follow . It depends on which is accessing first . Here college is written first so it will show first

   college  roll_no  college
0     piet       10     piet
1    jecrc       20    jecrc
2  raffels       30  raffels
3     piet       50     piet

### Loc and iloc = use to access perticular data from dataframe

#### Use of iloc = iloc support both row and collumn indexing as numpy

In [12]:
df.iloc[2:,2:]

   college  roll_no
2  raffels       30
3     piet       50

In [13]:
df.iloc[-2:,-2:]  # same can be done with -ve indexing

   college  roll_no
2  raffels       30
3     piet       50

#### Use of loc

##### loc dosent support collumn indexing

In [21]:
df.loc[2:3,["college",'roll_no']]

   college  roll_no
2  raffels       30
3     piet       50

In [15]:
df.loc[0:2] # access rows . But according to simple indexing for [0:2] , only 0 or 1 rows should be print but here 3 rows (0,1,2) are generating because in loc there is inclusive point and no need to access extra . It reaches and access as the given indexing without leaving last.

      Name Branch  college  roll_no
0   sachin    cse     piet       10
1  lakshay     it    jecrc       20
2  saurabh    ece  raffels       30

In [16]:
df.loc[0:1]

      Name Branch college  roll_no
0   sachin    cse    piet       10
1  lakshay     it   jecrc       20

Examples of accessing elements of df by loc and iloc with +ve and -ve indexing

In [17]:
df.iloc[1:3,0:3]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels

In [18]:
df.iloc[-3:-1,-4:-1]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels

In [19]:
df.loc[1:2,["Name","Branch","college"]]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels

In [20]:
df.loc[-3:-2,["Name","Branch","college"]]

Empty DataFrame
Columns: [Name, Branch, college]
Index: []